# PartUtils Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PartUtils Members
PartUtils Class Methods See Also
---
The PartUtils type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AreElementsValidForCreateParts | Identifies if the given elements can be used to create parts. |
| ArePartsValidForDivide | Identifies if provided members are valid for dividing parts. |
| ArePartsValidForMerge | Identifies whether Part elements may be merged. |
| CreateMergedPart | Create a single merged part which represents the Parts specified by partsToMerge. |
| CreateParts(Document, ICollection<(Of <<'(ElementId>)>>)) | Creates a new set of parts out of the original elements. |
| CreateParts(Document, ICollection<(Of <<'(LinkElementId>)>>)) | Creates a new set of parts out of the original elements. |
| DivideParts | Creates divided parts out of parts. |
| FindMergeableClusters | Segregates a set of elements into subsets which are valid for merge. |
| GetAssociatedPartMaker(Document, ElementId) | Gets associated PartMaker for an element. |
| GetAssociatedPartMaker(Document, LinkElementId) | Gets associated PartMaker for an element. |
| GetAssociatedParts(Document, ElementId, Boolean, Boolean) | Returns all Parts that are associated with the given element. |
| GetAssociatedParts(Document, LinkElementId, Boolean, Boolean) | Returns all Parts that are associated with the given element |
| GetChainLengthToOriginal | Calculates the length of the longest chain of divisions/merges to reach to an original non-Part element that is the source of the tested part. |
| GetMergedParts | Retrieves the element ids of the source elements of a merged part. |
| GetPartMakerMethodToDivideVolumeFW | Obtains the object allowing access to the divided volume properties of the PartMaker. |
| GetSplittingCurves(Document, ElementId) | Identifies the curves that were used to create the part. |
| GetSplittingCurves(Document, ElementId, Plane%) | Identifies the curves that were used to create the part and the plane in which they reside. |
| GetSplittingElements | Identifies the elements ( reference planes, levels, grids ) that were used to create the part. |
| HasAssociatedParts(Document, ElementId) | Checks if an element has associated parts. |
| HasAssociatedParts(Document, LinkElementId) | Checks if an element has associated parts. |
| IsMergedPart | Is the Part the result of a merge. |
| IsPartDerivedFromLink | Is the Part derived from link geometry. |
| IsValidForCreateParts | Identifies if the given element can be used to create parts. |

# See Also
PartUtils Class
Autodesk.Revit.DB Namespace